
# Делаем списки! == несколько элементов как один

l = [1, 2, 3, 4, 5] # Список
l[0] # 1
l[0:5] # [1, 2, 3, 4, 5]
l[::-1] # [5, 4, 3, 2, 1]

ll = [1, 2, 3, "4", "fabac", ["acasd", 3213412]]
print(ll[5][1]) # 3213412

# Функции списков

[1, 2, 3].append(2)
[1, 2, 3].extend([3, 2, 1])
a = [1, 2, 3].pop(0)

a = sorted([3, 2, 1])
[3, 2, 1].sort()

# Множества

s = {1, 2, 3, 3, 3, 3, 3}
s2 = {3, 4, 5}

print(s & s2) # {3} общая часть множества
print(s | s2)  # {1, 2, 3, 4, 5} # объединение множеств

l = [1, 2, 3, 3, 3, 4, 5]
l = list(set(l)) # list - список, set - множество
print(l) # [1, 2, 3, 4, 5]
